art-share/app/controllers/artworks_controller.rb

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["likeable_type", "Artwork"], ["likeable_id", 4], ["created_at", "2023-06-30 00:07:32.118562"], ["updated_at", "2023-06-30 00:07:32.118562"]]
---
    def like
        like = Like.new(user_id: params[:user_id], likeable_type: "Artwork", likeable_id: params[:artwork_id])

        if like.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def likers
        artwork = Artwork.find(params[:artwork_id])