art-share/app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if !params[:user_id].nil?
            user = User.find(params[:user_id])
            comments = user.comments
        elsif !params[:artwork_id].nil?
            artwork = Artwork.find(params[:artwork_id])
            comments = artwork.comments
        else
            comments = Comment.all

INSERT INTO "comments" ("body", "commenter_id", "artwork_commented_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Why does she look so angry?"], ["commenter_id", 6], ["artwork_commented_id", 1], ["created_at", "2023-06-29 20:51:49.713849"], ["updated_at", "2023-06-29 20:51:49.713849"]]
---
    def create
        comment = Comment.new(comments_params)

        if comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
---
    def destroy
        comment = Comment.find_by(id: params[:id])
        comment.destroy

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["likeable_type", "Comment"], ["likeable_id", 3], ["created_at", "2023-06-30 00:11:03.481604"], ["updated_at", "2023-06-30 00:11:03.481604"]]
---
    def like
        like = Like.new(user_id: params[:user_id], likeable_type: "Comment", likeable_id: params[:comment_id])

        if like.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def likers
        comment = Comment.find(params[:comment_id])