art-share/app/controllers/users_controller.rb

    def index
        if params[:username].nil?
            users = User.all
        else
            temp_str = "%#{params[:username]}%"
            users = User.where("username ILIKE ?", temp_str) # case insensitive
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (username LIKE '%('Dar')%')

    def update
        user = User.find_by(id: params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Elliot C"], ["updated_at", "2023-06-29 17:00:38.541191"], ["id", 8]]

    def destroy
        user = User.find_by(id: params[:id])
        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

    def likes
        user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]